---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodDiffuseLobeWeight
source: html/d93a6865-6fd3-755a-835f-ab569b065e0d.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodDiffuseLobeWeight Property

The property labeled "Weight of diffuse lobe" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodDiffuseLobeWeight { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".